atomvm/AtomVM/src/platforms/stm32/src/lib/sys.c
/*
 * This file is part of AtomVM.
 *
 * Copyright 2018 Riccardo Binetti <rbino@gmx.com>
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * SPDX-License-Identifier: Apache-2.0 OR LGPL-2.1-or-later
 */
#include <errno.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>

#include <avmpack.h>
#include <defaultatoms.h>
#include <scheduler.h>
#include <sys.h>

#ifdef ATOMVM_HAS_MBEDTLS
#include <mbedtls/platform_time.h>
#include <sys_mbedtls.h>

/* Minimum bytes the entropy pool collects from a hardware source before
 * it's considered seeded. mbedTLS defines this as MBEDTLS_ENTROPY_MIN_HARDWARE
 * in the private library/entropy_poll.h header; use the same value. */
#define STM32_ENTROPY_MIN_HARDWARE 32
#endif

// #define ENABLE_TRACE
#include <trace.h>

#include "stm32_hal_platform.h"

#include "avm_log.h"
#include "stm32_device_atoms.h"
#include "stm_sys.h"

#ifdef AVM_USB_CDC_PORT_DRIVER_ENABLED
#include "usb_cdc_driver.h"
#include <tusb.h>
#endif

#define TAG "sys"
#define RESERVE_STACK_SIZE 4096U

// clang-format off
static const char *const cpu_atom = "\x3" "cpu";
static const char *const device_atom = "\x6" "device";
static const char *const fpu_atom = "\x3" "fpu";
static const char *const series_atom = "\x6" "series";
static const char *const stm32_chip_info_atom = "\xF" "stm32_chip_info";
static const char *const stm32_cpu_atom = STM32_CPU_ATOM_LITERAL;
static const char *const stm32_device_atom = STM32_DEVICE_ATOM_LITERAL;
static const char *const stm32_fpu_atom = STM32_FPU_ATOM_LITERAL;
static const char *const stm32_series_atom = STM32_SERIES_ATOM_LITERAL;
// clang-format on

/* These functions are needed to fix a hard fault when using malloc in devices with sram spanning
 * multiple chips
 */
#pragma weak local_heap_setup = __local_ram

/* these are defined by the linker script */
extern uint8_t _ebss, _stack;

static uint8_t *_cur_brk = NULL;
static uint8_t *_heap_end = NULL;

#ifdef ATOMVM_HAS_MBEDTLS
static int stm32_rng_hw_init(struct STM32PlatformData *platform);
#endif

/*
 * If not overridden, this puts the heap into the left
 * over ram between the BSS section and the stack while
 * preserving RESERVE_STACK_SIZE bytes for the stack itself.
 * This may be overridden by defining the function
 * `local_heap_setup` (exported in `stm_sys.h`).
 */
static void __local_ram(uint8_t **start, uint8_t **end)
{
    *start = &_ebss;
    *end = (uint8_t *) (((uintptr_t) &_stack - RESERVE_STACK_SIZE));
}

void *sbrk(ptrdiff_t diff)
{
    uint8_t *_old_brk;

    if (_heap_end == NULL) {
        local_heap_setup(&_cur_brk, &_heap_end);
    }

    _old_brk = _cur_brk;
    if (_cur_brk + diff > _heap_end) {
        errno = ENOMEM;
        return (void *) -1;
    }
    _cur_brk += diff;
    return _old_brk;
}

static volatile uint64_t system_millis;

void SysTick_Handler(void)
{
    HAL_IncTick();
    system_millis++;
}

static inline void sys_clock_gettime(struct timespec *t)
{
    uint64_t now = sys_monotonic_time_u64();
    t->tv_sec = (time_t) now / 1000;
    t->tv_nsec = ((int32_t) now % 1000) * 1000000;
}

/* TODO: Needed because `defaultatoms_init` in libAtomVM/defaultatoms.c calls this function.
 * We should be able to remove this after `platform_defaulatoms.{c,h}` are removed on all platforms
 * and `defaultatoms_init` is no longer called.
 */
void platform_defaultatoms_init(GlobalContext *glb)
{
    UNUSED(glb);
}

void sys_enable_core_periph_clocks(void)
{
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();
    __HAL_RCC_GPIOE_CLK_ENABLE();
#ifdef __HAL_RCC_GPIOF_CLK_ENABLE
    __HAL_RCC_GPIOF_CLK_ENABLE();
#endif
#ifdef __HAL_RCC_GPIOG_CLK_ENABLE
    __HAL_RCC_GPIOG_CLK_ENABLE();
#endif
#ifdef __HAL_RCC_GPIOH_CLK_ENABLE
    __HAL_RCC_GPIOH_CLK_ENABLE();
#endif
#ifdef __HAL_RCC_GPIOI_CLK_ENABLE
    __HAL_RCC_GPIOI_CLK_ENABLE();
#endif
#ifdef __HAL_RCC_GPIOJ_CLK_ENABLE
    __HAL_RCC_GPIOJ_CLK_ENABLE();
#endif
#ifdef __HAL_RCC_GPIOK_CLK_ENABLE
    __HAL_RCC_GPIOK_CLK_ENABLE();
#endif

#ifndef AVM_DISABLE_GPIO_PORT_DRIVER
    /* Enable SYSCFG clock for EXTI configuration (not all families need it) */
#ifdef __HAL_RCC_SYSCFG_CLK_ENABLE
    __HAL_RCC_SYSCFG_CLK_ENABLE();
#endif
#endif
}

bool sys_lock_pin(GlobalContext *glb, uint32_t gpio_bank, uint16_t pin_num)
{
    struct STM32PlatformData *platform_data = glb->platform_data;
    struct ListHead *item;
    struct ListHead *tmp;
    if (!list_is_empty(&platform_data->locked_pins)) {
        MUTABLE_LIST_FOR_EACH (item, tmp, &platform_data->locked_pins) {
            struct LockedPin *gpio_pin = GET_LIST_ENTRY(item, struct LockedPin, locked_pins_list_head);
            if ((gpio_pin->gpio_bank == gpio_bank) && (gpio_pin->pin_num == pin_num)) {
                AVM_LOGW(TAG, "Pin is already reserved by the system!");
                return false;
            }
        }
    }

    struct LockedPin *data = malloc(sizeof(struct LockedPin));
    if (IS_NULL_PTR(data)) {
        AVM_LOGE(TAG, "Out of memory!");
        AVM_ABORT();
    }
    list_append(&platform_data->locked_pins, &data->locked_pins_list_head);
    data->gpio_bank = gpio_bank;
    data->pin_num = pin_num;

    return true;
}

bool sys_unlock_pin(GlobalContext *glb, uint32_t gpio_bank, uint16_t pin_num)
{
    struct STM32PlatformData *platform_data = glb->platform_data;
    struct ListHead *item;
    struct ListHead *tmp;
    if (!list_is_empty(&platform_data->locked_pins)) {
        MUTABLE_LIST_FOR_EACH (item, tmp, &platform_data->locked_pins) {
            struct LockedPin *gpio_pin = GET_LIST_ENTRY(item, struct LockedPin, locked_pins_list_head);
            if ((gpio_pin->gpio_bank == gpio_bank) && (gpio_pin->pin_num == pin_num)) {
                list_remove(item);
                free(gpio_pin);
                return true;
            }
        }
    }

    return false;
}

void sys_init_platform(GlobalContext *glb)
{
    struct STM32PlatformData *platform = malloc(sizeof(struct STM32PlatformData));
    if (IS_NULL_PTR(platform)) {
        AVM_LOGE(TAG, "Out of memory!");
        AVM_ABORT();
    }
    glb->platform_data = platform;
    list_init(&platform->locked_pins);
#ifdef ATOMVM_HAS_MBEDTLS
    platform->entropy_is_initialized = false;
    platform->random_is_initialized = false;
    if (stm32_rng_hw_init(platform) != 0) {
        AVM_LOGE(TAG, "Failed to initialize RNG peripheral");
        AVM_ABORT();
    }
#endif
}

void sys_free_platform(GlobalContext *glb)
{
    struct STM32PlatformData *platform = glb->platform_data;
#ifdef ATOMVM_HAS_MBEDTLS
    if (platform->random_is_initialized) {
        mbedtls_ctr_drbg_free(&platform->random_ctx);
    }
    if (platform->entropy_is_initialized) {
        mbedtls_entropy_free(&platform->entropy_ctx);
    }
    // HAL_RNG_Init succeeded in stm32_rng_hw_init or we aborted
    HAL_RNG_DeInit(&platform->rng);
#endif

    struct ListHead *item;
    struct ListHead *tmp;
    MUTABLE_LIST_FOR_EACH (item, tmp, &platform->locked_pins) {
        struct LockedPin *gpio_pin = GET_LIST_ENTRY(item, struct LockedPin, locked_pins_list_head);
        list_remove(item);
        free(gpio_pin);
    }

    free(platform);
    glb->platform_data = NULL;
}

void sys_poll_events(GlobalContext *glb, int timeout_ms)
{
    UNUSED(glb);
    UNUSED(timeout_ms);
#ifdef AVM_USB_CDC_PORT_DRIVER_ENABLED
    if (tud_inited()) {
        usb_cdc_driver_poll();
    }
#endif
}

void sys_listener_destroy(struct ListHead *item)
{
    UNUSED(item);
}

void sys_register_select_event(GlobalContext *global, ErlNifEvent event, bool is_write)
{
    UNUSED(global);
    UNUSED(event);
    UNUSED(is_write);
}

void sys_unregister_select_event(GlobalContext *global, ErlNifEvent event, bool is_write)
{
    UNUSED(global);
    UNUSED(event);
    UNUSED(is_write);
}

void sys_time(struct timespec *t)
{
    sys_clock_gettime(t);
}

void sys_monotonic_time(struct timespec *t)
{
    sys_clock_gettime(t);
}

uint64_t sys_monotonic_time_u64(void)
{
    /* 64-bit read is not atomic on 32-bit ARM; disable interrupts briefly
     * to prevent SysTick_Handler from updating system_millis mid-read.
     * Save/restore PRIMASK so this is safe if called with IRQs already disabled. */
    uint32_t primask = __get_PRIMASK();
    __disable_irq();
    uint64_t val = system_millis;
    __set_PRIMASK(primask);
    return val;
}

uint64_t sys_monotonic_time_ms_to_u64(uint64_t ms)
{
    return ms;
}

uint64_t sys_monotonic_time_u64_to_ms(uint64_t t)
{
    return t;
}

enum OpenAVMResult sys_open_avm_from_file(GlobalContext *global, const char *path, struct AVMPackData **data)
{
    UNUSED(global);
    UNUSED(path);
    UNUSED(data);
    TRACE("sys_open_avm_from_file: Going to open: %s\n", path);

    // TODO
    AVM_LOGW(TAG, "Open from file not supported on this platform.");
    return AVM_OPEN_NOT_SUPPORTED;
}

Module *sys_load_module_from_file(GlobalContext *global, const char *path)
{
    UNUSED(global);
    UNUSED(path);
    // TODO
    return NULL;
}

Context *sys_create_port(GlobalContext *glb, const char *driver_name, term opts)
{
    Context *new_ctx = port_driver_create_port(driver_name, glb, opts);
    if (IS_NULL_PTR(new_ctx)) {
        AVM_LOGE(TAG, "Failed to load port \"%s\".  Ensure the port is configured properly in the build.", driver_name);
        new_ctx = NULL;
    }
    return new_ctx;
}

term sys_get_info(Context *ctx, term key)
{
    GlobalContext *glb = ctx->global;
    if (key == globalcontext_make_atom(glb, stm32_chip_info_atom)) {
        if (memory_ensure_free(ctx, term_map_size_in_terms(4)) != MEMORY_GC_OK) {
            return OUT_OF_MEMORY_ATOM;
        }
        term ret = term_alloc_map(4, &ctx->heap);
        term_set_map_assoc(ret, 0, globalcontext_make_atom(glb, cpu_atom), globalcontext_make_atom(glb, stm32_cpu_atom));
        term_set_map_assoc(ret, 1, globalcontext_make_atom(glb, device_atom), globalcontext_make_atom(glb, stm32_device_atom));
        term_set_map_assoc(ret, 2, globalcontext_make_atom(glb, fpu_atom), globalcontext_make_atom(glb, stm32_fpu_atom));
        term_set_map_assoc(ret, 3, globalcontext_make_atom(glb, series_atom), globalcontext_make_atom(glb, stm32_series_atom));
        return ret;
    }
    return UNDEFINED_ATOM;
}

void sys_enable_flash_cache(void)
{
    /* Enable flash prefetch and set appropriate wait states.
     * The exact wait states depend on clock frequency and voltage range,
     * but HAL_Init() and SystemClock_Config() will set them correctly.
     * Here we just enable prefetch and instruction cache early. */
#ifdef __HAL_FLASH_PREFETCH_BUFFER_ENABLE
    __HAL_FLASH_PREFETCH_BUFFER_ENABLE();
#endif
#ifdef __HAL_FLASH_INSTRUCTION_CACHE_ENABLE
    __HAL_FLASH_INSTRUCTION_CACHE_ENABLE();
#endif
#ifdef __HAL_FLASH_DATA_CACHE_ENABLE
    __HAL_FLASH_DATA_CACHE_ENABLE();
#endif
}

/* See: ARM V7-M Architecture Reference Manual */
void sys_init_icache(void)
{
    __DSB();
    __ISB();
#if defined(__ICACHE_PRESENT) && (__ICACHE_PRESENT == 1U)
    SCB_EnableICache();
#endif
#if defined(__DCACHE_PRESENT) && (__DCACHE_PRESENT == 1U)
    SCB_EnableDCache();
#endif
    /* STM32H5 and STM32U5 (Cortex-M33) have a dedicated ICACHE peripheral.
     * Invalidate then enable after SystemClock_Config() has set flash latency. */
#ifdef HAL_ICACHE_MODULE_ENABLED
    HAL_ICACHE_Invalidate();
    HAL_ICACHE_Enable();
#endif
    __DSB();
    __ISB();
}

/* Empty _init/_fini stubs required by __libc_init_array when
 * linking with -nostartfiles (which skips crti.o/crtn.o). */
void _init(void)
{
}

void _fini(void)
{
}

#ifndef AVM_NO_JIT
ModuleNativeEntryPoint sys_map_native_code(const uint8_t *code, size_t code_size)
{
    UNUSED(code_size);
    // We need to set the Thumb bit
    return (ModuleNativeEntryPoint) ((uintptr_t) code | 1);
}

void sys_release_native_code(ModuleNativeEntryPoint entry_point)
{
    // Native code points into flash; nothing to free
    UNUSED(entry_point);
}
#endif

#ifdef ATOMVM_HAS_MBEDTLS

/*
 * Hardware-backed entropy via STM32 TRNG.
 */
static int stm32_rng_hw_init(struct STM32PlatformData *platform)
{
#if defined(RCC_OSCILLATORTYPE_HSI48) && defined(RCC_RNGCLKSOURCE_HSI48)
    /* Newer families (F7/G4/H5/H7/L4/L5/U3/U5/WB) gate the RNG on a 48 MHz
     * kernel clock that HSI48 can provide independently of the system PLL.
     * Bring HSI48 up and select it as the RNG clock source so the
     * peripheral works without depending on the specific PLL layout.
     * OscillatorType is HSI48 only; HAL_RCC_OscConfig won't touch the PLL
     * fields, which differ across families (.PLL on H7, .PLL1/.PLL2 on
     * U3/U5). */
    RCC_OscInitTypeDef osc_init = { 0 };
    osc_init.OscillatorType = RCC_OSCILLATORTYPE_HSI48;
    osc_init.HSI48State = RCC_HSI48_ON;
    if (HAL_RCC_OscConfig(&osc_init) != HAL_OK) {
        return -1;
    }

    RCC_PeriphCLKInitTypeDef periph = { 0 };
    periph.PeriphClockSelection = RCC_PERIPHCLK_RNG;
    periph.RngClockSelection = RCC_RNGCLKSOURCE_HSI48;
    if (HAL_RCCEx_PeriphCLKConfig(&periph) != HAL_OK) {
        return -1;
    }
#else
    /* F2/F4 take their RNG kernel clock from PLL48CLK (PLL_VCO / PLLQ),
     * which clock_config_f{2,4}.c already configures for ~48 MHz. */
#endif

    __HAL_RCC_RNG_CLK_ENABLE();
    memset(&platform->rng, 0, sizeof(platform->rng));
    platform->rng.Instance = RNG;
    if (HAL_RNG_Init(&platform->rng) != HAL_OK) {
        return -1;
    }
    return 0;
}

int mbedtls_hardware_poll(void *data, unsigned char *output, size_t len, size_t *olen)
{
    GlobalContext *global = data;
    if (IS_NULL_PTR(global) || IS_NULL_PTR(global->platform_data)) {
        return MBEDTLS_ERR_ENTROPY_SOURCE_FAILED;
    }

    struct STM32PlatformData *platform = global->platform_data;

    size_t written = 0;
    while (written < len) {
        uint32_t r;
        if (HAL_RNG_GenerateRandomNumber(&platform->rng, &r) != HAL_OK) {
            return MBEDTLS_ERR_ENTROPY_SOURCE_FAILED;
        }
        size_t chunk = len - written;
        if (chunk > sizeof(r)) {
            chunk = sizeof(r);
        }
        memcpy(output + written, &r, chunk);
        written += chunk;
    }
    *olen = written;
    return 0;
}

mbedtls_ms_time_t mbedtls_ms_time(void)
{
    return (mbedtls_ms_time_t) HAL_GetTick();
}

int sys_mbedtls_entropy_func(void *entropy, unsigned char *buf, size_t size)
{
    return mbedtls_entropy_func(entropy, buf, size);
}

mbedtls_entropy_context *sys_mbedtls_get_entropy_context_lock(GlobalContext *global)
{
    struct STM32PlatformData *platform = global->platform_data;
    if (!platform->entropy_is_initialized) {
        mbedtls_entropy_init(&platform->entropy_ctx);
        int entropy_err = mbedtls_entropy_add_source(&platform->entropy_ctx,
            mbedtls_hardware_poll, global,
            STM32_ENTROPY_MIN_HARDWARE,
            MBEDTLS_ENTROPY_SOURCE_STRONG);
        if (UNLIKELY(entropy_err != 0)) {
            AVM_LOGE(TAG, "mbedtls_entropy_add_source failed: %d", entropy_err);
            AVM_ABORT();
        }
        platform->entropy_is_initialized = true;
    }
    return &platform->entropy_ctx;
}

void sys_mbedtls_entropy_context_unlock(GlobalContext *global)
{
    UNUSED(global);
}

mbedtls_ctr_drbg_context *sys_mbedtls_get_ctr_drbg_context_lock(GlobalContext *global)
{
    struct STM32PlatformData *platform = global->platform_data;
    if (!platform->random_is_initialized) {
        mbedtls_ctr_drbg_init(&platform->random_ctx);

        mbedtls_entropy_context *entropy_ctx = sys_mbedtls_get_entropy_context_lock(global);
        sys_mbedtls_entropy_context_unlock(global);

        const char *seed = "AtomVM STM32 Mbed-TLS initial seed.";
        int seed_err = mbedtls_ctr_drbg_seed(&platform->random_ctx,
            sys_mbedtls_entropy_func, entropy_ctx,
            (const unsigned char *) seed, strlen(seed));
        if (UNLIKELY(seed_err != 0)) {
            AVM_LOGE(TAG, "mbedtls_ctr_drbg_seed failed: %d", seed_err);
            AVM_ABORT();
        }
        platform->random_is_initialized = true;
    }
    return &platform->random_ctx;
}

void sys_mbedtls_ctr_drbg_context_unlock(GlobalContext *global)
{
    UNUSED(global);
}

#endif /* ATOMVM_HAS_MBEDTLS */
